{
    "inputs": {
        "input_goals": "Grow my social media following, maximise impressions on my content",
        "input_keydates": "",
        "input_media": "Taking iPhone photos, Making TikTok style short videos with my iPhone, creating super simple Canva designs with basic text and shapes",
        "input_uniqueness": "High",
        "userinputsummary_pastsuccesses": "",
        "userinputsummary_partnerships": "",
        "userinputsummary_sminsights": "",
        "input_success": "Posting testimonials from happy customers that are in video format and have them talking about how much they love spending time in the cafe and how good the staff are, also doing behind the scenes videos showing off the staffs personalities",
        "input_partnerships": "We have a partnership with a local craft store and we stock their products such as jars and containers which we sell in store from a display.",
        "input_stats": "Our facebook page has 45000 likes and we get about 7000 views and 500 comments and maybe like 30 likes on each post. On instagram we have 1000 followers and we get about 1200 views and 40 comments and 70 likes on each post.",
        "input_customtopic": "Freshly made sandwiches",
        "input_specificinfo_custom": "",
        "input_goals_custom": "",
        "input_startdate": "May 9 2025",
        "calpost_1": "Title: 2 Discover the Magic of Our Flavourful Organic Coffee\n\nIdea: A series of staff videos disclosing how our organic coffee beans enhance the flavour, appealing to health-conscious customers with its benefits.\n\nContent Theme: Quality Food & Beverages\n\nPurpose: To create awareness and increase interest in our unique organic coffee offerings.\n\nMedia: Short videos of staff revealing the reason why our coffee tastes so good.",
        "input_feq": "",
        "calpost_2": "Title: 2 Our People, Our Values\n\nIdea: A tribute to our staff who exemplify the values of the Cosy Corner Cafe in serving our customers.\n\nContent Theme: Employee Well-being & Inclusive Culture\n\nPurpose: To show customers our commitment towards upholding our core values in daily operations.\n\nMedia: iPhone photo of the employee who demonstrated our values.",
        "calpost_3": "Title: 5 The Wonderful Journey of Our Homemade Pastries\n\nIdea: A short video showcasing our variety of fresh homemade pastries, freshly baked daily for our beloved customers.\n\nContent Theme: Quality Food & Beverages\n\nPurpose: To showcase the quality and freshness of our homemade pastries, tempting customers to come in for a treat.\n\nMedia: TikTok style short video showing the pastry-making process and the final product."
    },
    "outputs": {
        "postidea_1": "Title: Nutella Moments of Merry\n\nIdea: \"Nutella Moments of Merry\" - Imagine gifting these Nutella-filled treats to loved ones. Each doughnut becomes a shared nibble of festive delight, inviting warmth and smiles amidst holiday preparations; Call-to-Action: \"Swing by to grab a dozen doughnuts to share the merry!\"; Creative Focus: Visual-Focused.\n\nPurpose: Increase Foot Traffic\n\nMedia: A cosy, inviting video showing a fresh batch of Nutella doughnuts being dusted with powdered sugar. Capture the process of wrapping these doughnuts in a simple, festive box tied with a ribbon. Overlay text reads, “Share the warmth with a Nutella surprise!” Use warm lighting and festive decorations.",
        "postidea_2": "Title: Coffee with a Cause\n\nIdea: \"Coffee with a Cause\" - Each cup supports initiatives that better the community. Experience your coffee as not just a morning wake-up but a small act of kindness that contributes to larger community efforts; Call-to-Action: \"Join us for a cup that cares—visit us today and support local initiatives!\"; Creative Focus: Concept-Focused.\n\nPurpose: Promote Awareness\n\nMedia: A designed graphic showcasing a steaming cup of coffee with community-focused symbols (handshakes, hearts, etc.). Text overlays the image, reading, “Every cup helps our community. Sip with purpose!” Use warm tones and incorporate natural wood textures for a comforting visual.",
        "postidea_3": "Title: Sip Back in Time\n\nIdea: \"Sip Back in Time\" - Relive childhood Christmas mornings with each indulgent sip. This hot chocolate, topped with fluffy marshmallows, offers a cosy embrace on chilly winter evenings; Call-to-Action: \"Pop in to warm up with a cup full of nostalgia!\"; Creative Focus: Visual-Focused.\n\nPurpose: Drive Engagement\n\nMedia: A fun, short video clip capturing a marshmallow floating atop hot chocolate slowly melting into creamy swirls. Overlay text reads, “Childhood in a cup this Christmas!” Include subtle sound effects of crackling winter fires to evoke a sense of warmth and nostalgia.",
        "postidea_4": "Title: Pancake Paradise\n\nIdea: \"Pancake Paradise\" - After the bustling festivities, unwind with a stack of fluffy pancakes, perfect for a lazy morning with family, where syrupy sweetness marks the bliss of a slow day; Call-to-Action: \"Treat yourself—stop by for a lazy morning pancake feast!\"; Creative Focus: Visual-Focused.\n\nPurpose: Increase Foot Traffic\n\nMedia: A photo carousel featuring stacks of golden pancakes drenched in syrup, butter melting on top, set against a beautifully laid-back breakfast table. Use morning light to give a homely, serene feel and add wooden cutlery.",
        "postidea_5": "Title: Sunset Suppers\n\nIdea: \"Sunset Suppers\" - Pack a couple of toasted sandwiches for your beach outing, where they become the staple of your picnic, blending sumptuous flavours with ease and mobility; Call-to-Action: \"Grab a toasty favourite for your next beach picnic!\"; Creative Focus: Visual-Focused; Date/Event: Summer Holidays.\n\nPurpose: Drive Engagement\n\nMedia: Capture a lifestyle TikTok-style video of a beach picnic featuring a diverse selection of toasted sandwiches being unpacked and enjoyed at sunset. Show hands reaching for sandwiches, with waves gently crashing in the background.",
        "postidea_6": "Title: Adventure Fuel\n\nIdea: \"Adventure Fuel\" - Nuggets and fries become the backdrop of laughter and play during summer holidays, effortlessly satisfying kids after an action-packed day by the pool; Call-to-Action: \"Refuel those summer adventures—treat the kids to their favourites!\"; Creative Focus: Concept-Focused; Date/Event: Summer Holidays.\n\nPurpose: Increase Foot Traffic\n\nMedia: A playful photo of a colourful poolside scene, showcasing a kids' tray with nuggets and fries artfully arranged, surrounded by pool toys. Use vibrant colours to capture the essence of fun and summer.",
        "postidea_7": "Title: Boxing Day Bliss\n\nIdea: \"Boxing Day Bliss\" - This organic coffee helps ease the transition from festive celebrations to everyday calm, offering a tranquil morning brew that revitalises and refreshes; Call-to-Action: \"Join us for a breather with our organic brews!\"; Creative Focus: Concept-Focused.\n\nPurpose: Build Community\n\nMedia: A serene early morning photo capturing a steaming cup of organic fair-trade coffee on a wooden table by the window, with natural light pouring in. Use earthy tones.",
        "postidea_8": "Title: Wrap and Roll\n\nIdea: \"Wrap and Roll\" - Perfect for spontaneous summer picnics, these wraps provide a satisfying bite without weighing you down, embodying the lightness and zest of the season; Call-to-Action: \"Ready, set, wrap! Grab yours for the perfect picnic bite!\"; Creative Focus: Visual-Focused; Date/Event: Summer Holidays.\n\nPurpose: Increase Foot Traffic\n\nMedia: A dynamic video showcasing different wraps being rolled and sliced, set against a backdrop of picnic essentials like a blanket and a wicker basket. The video ends with a hand grabbing the wraps.",
        "posttitle_1": "Nutella Moments of Merry",
        "posttitle_2": "Coffee with a Cause",
        "posttitle_3": "Sip Back in Time",
        "posttitle_4": "Pancake Paradise",
        "posttitle_5": "Sunset Suppers",
        "posttitle_6": "Adventure Fuel",
        "posttitle_7": "Boxing Day Bliss",
        "posttitle_8": "Wrap and Roll",
        "postidea_9": "",
        "postidea_10": "",
        "posttitle_9": "",
        "posttitle_10": ""
    },
    "repo": {
        "repopostidea_1": "Title: Wrap and Roll\n\nIdea: \"Wrap and Roll\" - Perfect for spontaneous summer picnics, these wraps provide a satisfying bite without weighing you down, embodying the lightness and zest of the season; Call-to-Action: \"Ready, set, wrap! Grab yours for the perfect picnic bite!\"; Creative Focus: Visual-Focused; Date/Event: Summer Holidays.\n\nPurpose: Increase Foot Traffic\n\nMedia: A dynamic video showcasing different wraps being rolled and sliced, set against a backdrop of picnic essentials like a blanket and a wicker basket. The video ends with a hand grabbing the wraps.",
        "repopostidea_2": "Title: Boxing Day Bliss\n\nIdea: \"Boxing Day Bliss\" - This organic coffee helps ease the transition from festive celebrations to everyday calm, offering a tranquil morning brew that revitalises and refreshes; Call-to-Action: \"Join us for a breather with our organic brews!\"; Creative Focus: Concept-Focused.\n\nPurpose: Build Community\n\nMedia: A serene early morning photo capturing a steaming cup of organic fair-trade coffee on a wooden table by the window, with natural light pouring in. Use earthy tones.",
        "repopostidea_3": "Title: Adventure Fuel\n\nIdea: \"Adventure Fuel\" - Nuggets and fries become the backdrop of laughter and play during summer holidays, effortlessly satisfying kids after an action-packed day by the pool; Call-to-Action: \"Refuel those summer adventures—treat the kids to their favourites!\"; Creative Focus: Concept-Focused; Date/Event: Summer Holidays.\n\nPurpose: Increase Foot Traffic\n\nMedia: A playful photo of a colourful poolside scene, showcasing a kids' tray with nuggets and fries artfully arranged, surrounded by pool toys. Use vibrant colours to capture the essence of fun and summer.",
        "repopostidea_4": "Title: Sunset Suppers\n\nIdea: \"Sunset Suppers\" - Pack a couple of toasted sandwiches for your beach outing, where they become the staple of your picnic, blending sumptuous flavours with ease and mobility; Call-to-Action: \"Grab a toasty favourite for your next beach picnic!\"; Creative Focus: Visual-Focused; Date/Event: Summer Holidays.\n\nPurpose: Drive Engagement\n\nMedia: Capture a lifestyle TikTok-style video of a beach picnic featuring a diverse selection of toasted sandwiches being unpacked and enjoyed at sunset. Show hands reaching for sandwiches, with waves gently crashing in the background.",
        "repopostidea_5": "Title: Pancake Paradise\n\nIdea: \"Pancake Paradise\" - After the bustling festivities, unwind with a stack of fluffy pancakes, perfect for a lazy morning with family, where syrupy sweetness marks the bliss of a slow day; Call-to-Action: \"Treat yourself—stop by for a lazy morning pancake feast!\"; Creative Focus: Visual-Focused.\n\nPurpose: Increase Foot Traffic\n\nMedia: A photo carousel featuring stacks of golden pancakes drenched in syrup, butter melting on top, set against a beautifully laid-back breakfast table. Use morning light to give a homely, serene feel and add wooden cutlery.",
        "repopostidea_6": "Title: Sip Back in Time\n\nIdea: \"Sip Back in Time\" - Relive childhood Christmas mornings with each indulgent sip. This hot chocolate, topped with fluffy marshmallows, offers a cosy embrace on chilly winter evenings; Call-to-Action: \"Pop in to warm up with a cup full of nostalgia!\"; Creative Focus: Visual-Focused.\n\nPurpose: Drive Engagement\n\nMedia: A fun, short video clip capturing a marshmallow floating atop hot chocolate slowly melting into creamy swirls. Overlay text reads, “Childhood in a cup this Christmas!” Include subtle sound effects of crackling winter fires to evoke a sense of warmth and nostalgia.",
        "repopostidea_7": "Title: Coffee with a Cause\n\nIdea: \"Coffee with a Cause\" - Each cup supports initiatives that better the community. Experience your coffee as not just a morning wake-up but a small act of kindness that contributes to larger community efforts; Call-to-Action: \"Join us for a cup that cares—visit us today and support local initiatives!\"; Creative Focus: Concept-Focused.\n\nPurpose: Promote Awareness\n\nMedia: A designed graphic showcasing a steaming cup of coffee with community-focused symbols (handshakes, hearts, etc.). Text overlays the image, reading, “Every cup helps our community. Sip with purpose!” Use warm tones and incorporate natural wood textures for a comforting visual.",
        "repopostidea_8": "Title: Nutella Moments of Merry\n\nIdea: \"Nutella Moments of Merry\" - Imagine gifting these Nutella-filled treats to loved ones. Each doughnut becomes a shared nibble of festive delight, inviting warmth and smiles amidst holiday preparations; Call-to-Action: \"Swing by to grab a dozen doughnuts to share the merry!\"; Creative Focus: Visual-Focused.\n\nPurpose: Increase Foot Traffic\n\nMedia: A cosy, inviting video showing a fresh batch of Nutella doughnuts being dusted with powdered sugar. Capture the process of wrapping these doughnuts in a simple, festive box tied with a ribbon. Overlay text reads, “Share the warmth with a Nutella surprise!” Use warm lighting and festive decorations.",
        "repopostidea_9": "Title: Day-starter Rituals\n\nIdea: Day-starter Rituals - Coffee is more than just a morning pick-me-up, it’s an anchoring daily ritual imbued with comfort and familiarity, setting the tone for the day; Inspirational Day-starter Rituals - Showcase the delightful ease of combining coffee with the soothing rhythm of daily rituals, resonating with comfort and a heartening familiarity that gives a reassuring start to the day; Call-to-Action: \"Share your morning coffee ritual with us. #DayStarterRituals\"; Creative Focus: Concept-Focused; Content Category: Inspirational.\n\nPurpose: Drive Engagement\n\nMedia: A warm-toned Instagram story featuring a photo carousel of the making and serving of our signature coffee, accompanied by an engaging step-by-step caption of the preparation process.",
        "repopostidea_10": "Title: Morning Bliss Bites\n\nIdea: Morning Bliss Bites - Starting the day with pancakes isn’t just about satisfying hunger in the morning; it’s about immersing oneself in a sweet, positive moment of personal indulgence; Entertaining Morning Bliss Bites - Capture the uplifting moment your day starts with pancakes. It's about weaving a narrative of indulgence and joy – a sweet interlude for the morning hustle; Call-to-Action: \"Take a break. Join us for a sweet escapade in the morning. Comment with your favourite pancake topping!\"; Creative Focus: Visual-Focused; Content Category: Entertaining.\n\nPurpose: Build Community\n\nMedia: A TikTok-style short video capturing the fun process of making pancakes, pouring the syrup, a dramatic slow motion shot of the fork breaking down the fluffy pancake stack, and a delighted customer taking the first bite.",
        "repopostidea_11": "Title: Your Favourite Sandwich, Freshly Made and Now More Accessible: Special Prices at Cosy Corner!\n\nIdea: A post to delight our valued customers with special prices on our freshly made sandwiches.\n\nKey Aspect/Angle: A unique opportunity crafted to celebrate you and make our high quality food more accessible.\n\nPurpose: To show our thanks to our wonderful customers by announcing special pricing, inviting everyone to enjoy this offer.\n\nMedia: A lively Canva design showcasing delicious sandwiches with a striking banner announcing the special prices.",
        "repopostidea_12": "Title: Fresh From Cosy Corner: Tantalising Your Taste Buds with Our Sandwich Delights\n\nIdea: A post singing praises to the freshness and quality of our uniquely-crafted sandwiches. \n\nKey Aspect/Angle: This post focuses on our cafe's commitment to valued customers by preparing sandwiches from fresh, locally-sourced ingredients.\n\nPurpose: To appreciate our valued customers by making them aware of the freshness of our sandwiches, inviting you to try and share your gourmet story.\n\nMedia: A short video - a beautiful journey from sourcing the fresh ingredients to the final delightful creation.",
        "repopostidea_13": "Title: Cosy Corner: Heart of the Community\n\nIdea: Showcasing our active involvement with local communities, ranging from hosting \"Coffee and Conversations\" event to promoting community discussions.\n\nContent Theme: Inspirational\n\nPurpose: To underscore our community involvement, focusing on the value we offer to our customers beyond mere food, aiming to boost our social media following.\n\nMedia: An iPhone photo montage showcasing prior \"Coffee and Conversations\" events and participants.",
        "repopostidea_14": "Title: Coffee and Conversations at Cosy Corner\n\nIdea: Announcing our monthly \"Coffee and Conversations\" event where we invite locals to discuss community matters over a cuppa.\n\nContent Theme: Promotional\n\nPurpose: To stimulate audience engagement, increase content impressions, and draw in new followers interested in community activities.\n\nMedia: A Canva design showcasing details of the event coupled with a photo of the cafe.",
        "repopostidea_15": "Title: Minimising Footprints, One Brew at a Time\n\nIdea: Detailing how our sourcing of local coffee beans helps cut down our carbon footprint.\n\nContent Theme: Behind The Scenes Content\n\nPurpose: To heighten awareness about our commitment to shrink our environmental impact, thereby gaining followers and boosting impressions.\n\nMedia: A short video unveiling how we procure coffee locally, including scenes of coffee plantations, our café, and the brewing process.",
        "repopostidea_16": "Title: Our Green Pledge at Cosy Corner\n\nIdea: Sharing our sustainable initiatives such as using compostable and biodegradable packaging and sourcing ingredients locally.\n\nContent Theme: Inspirational\n\nPurpose: To illustrate our deep concern for the environment, aiming to expand our social media following.\n\nMedia: A Canva design pinpointing our sustainability practices.",
        "repopostidea_17": "Title: Daily Freshness: Our Handmade Pastries\n\nIdea: Showcasing our homemade pastries, their variety, and freshness, baked daily for our customers’ delight.\n\nContent Theme: Behind The Scenes Content\n\nPurpose: To stress the freshness and effort put into our pastries, targeting to gain more followers and enhance content impressions.\n\nMedia: A short TikTok-style video presenting the process of our pastries being baked and served.",
        "repopostidea_18": "Title: Rise and Shine with our Superior Coffee\n\nIdea: Promoting our top-notch coffee, detailing the variety of coffee we provide and how they're freshly brewed each day.\n\nContent Theme: Promotional\n\nPurpose: To brew excitement about our coffee offerings, with the aim of attracting more customers and followers.\n\nMedia: iPhone photos of diverse coffee options served in our café.",
        "repopostidea_19": "Title: Local Bean to Cup Journey\n\nIdea: Highlighting the fresh burst of our coffee beans and how they are sourced locally and organically.\n\nContent Theme: Behind The Scenes Content\n\nPurpose: To showcase our dedication to quality and support for local farms, intending to increase followers and post impressions.\n\nMedia: Short TikTok-style video illustrating the process from acquiring coffee beans from local farms to being brewed in our café.",
        "repopostidea_20": "Title: Straight from Farm to Fork\n\nIdea: Applauding our commitment to locally sourced ingredients, featuring the nearby farms we work with and the farm-fresh ingredients we use.\n\nContent Theme: Promotional\n\nPurpose: To heighten awareness about our dedication to local products, driving audience engagement and attracting more followers.\n\nMedia: Canva Design featuring images of the local farms we draw upon and the fresh ingredients we incorporate in our café menu.",
        "repopostidea_21": "Title: Your Home-from-Home Café Corner\n\nIdea: Showcasing our café's cosy corner where customers savour their coffee and pastries, making them feel right at home. \n\nContent Theme: Entertaining\n\nPurpose: To interact with the audience and entice them to pay a visit to our café, bolstering our social media following.\n\nMedia: iPhone photos depicting the best corners of the café bustling with customers enjoying their laid-back time.",
        "repopostidea_22": "Title: Your Cosy Comfort Nook\n\nIdea: Showcasing our snug interiors and the homely atmosphere of the café, beckoning locals and tourists to unwind and savour our offerings.\n\nContent Theme: Inspirational\n\nPurpose: To magnetise more followers and amplify impressions, emphasising the cosy and welcoming ambiance of the café.\n\nMedia: A short TikTok-style video featuring a panoramic sweep of the café's interior, capturing its quaint decor and customers relishing a leisurely day.",
        "repopostidea_23": "Title: 5 The Wonderful Journey of Our Homemade Pastries\n\nIdea: A short video showcasing our variety of fresh homemade pastries, freshly baked daily for our beloved customers.\n\nContent Theme: Quality Food & Beverages\n\nPurpose: To showcase the quality and freshness of our homemade pastries, tempting customers to come in for a treat.\n\nMedia: TikTok style short video showing the pastry-making process and the final product.",
        "repopostidea_24": "Title: 5 Let's Nurture Community Ties Over a Cup of Coffee\n\nIdea: An invitation to our upcoming monthly \"Coffee and Conversations\" event focused on fostering community ties over a cup of coffee.\n\nContent Theme: Community Involvement & Support\n\nPurpose: To emphasise our involvement in the community and invite customers to connect with their neighbours.\n\nMedia: iPhone photograph capturing the spirit of our previous event to inspire participation.",
        "repopostidea_25": "Title: 5 Get to Know the Cosy Corner Family\n\nIdea: A series introducing our remarkable team that makes your visit to Cosy Corner Cafe memorable.\n\nContent Theme: Employee Well-being & Inclusive Culture\n\nPurpose: To humanize our brand and let customers know the people who serve them.\n\nMedia: Short TikTok style videos introducing our team members.",
        "repopostidea_26": "Title: 2 Our People, Our Values\n\nIdea: A tribute to our staff who exemplify the values of the Cosy Corner Cafe in serving our customers.\n\nContent Theme: Employee Well-being & Inclusive Culture\n\nPurpose: To show customers our commitment towards upholding our core values in daily operations.\n\nMedia: iPhone photo of the employee who demonstrated our values.",
        "repopostidea_27": "Title: 5 The Wonderful Journey of Our Homemade Pastries\n\nIdea: A short video showcasing our variety of fresh homemade pastries, freshly baked daily for our beloved customers.\n\nContent Theme: Quality Food & Beverages\n\nPurpose: To showcase the quality and freshness of our homemade pastries, tempting customers to come in for a treat.\n\nMedia: TikTok style short video showing the pastry-making process and the final product.",
        "repopostidea_28": "Title: 2 Discover the Magic of Our Flavourful Organic Coffee\n\nIdea: A series of staff videos disclosing how our organic coffee beans enhance the flavour, appealing to health-conscious customers with its benefits.\n\nContent Theme: Quality Food & Beverages\n\nPurpose: To create awareness and increase interest in our unique organic coffee offerings.\n\nMedia: Short videos of staff revealing the reason why our coffee tastes so good.",
        "repopostidea_29": "Title: 2 Embracing Our Greener Future, Together\n\nIdea: We proudly stand committed to reducing environmental impact by using sustainable packaging and rely on local farmers for fresh ingredients.\n\nContent Theme: Sustainability & Ethical Practices\n\nPurpose: To raise awareness about our sustainable practices and inspire customers to choose sustainable consumption.\n\nMedia: iPhone photos capturing our commitment towards the environment and local community.",
        "repopostidea_30": "Title: 2 Appreciating Our Local Farming Heroes\n\nIdea: A series introducing the people behind our fresh tasty food - local farmers we source our ingredients from, emphasising our commitment to local sourcing and sustainability.\n\nContent Theme: Sustainability & Ethical Practices\n\nPurpose: To illustrate our commitment to the local economy and sustainable practices.\n\nMedia: TikTok style short video interviews with local farmers.",
        "repopostidea_31": "Title: 2 Let's Nurture Community Ties Over a Cup of Coffee\n\nIdea: An invitation to our upcoming monthly \"Coffee and Conversations\" event focused on fostering community ties over a cup of coffee.\n\nContent Theme: Community Involvement & Support\n\nPurpose: To emphasise our involvement in the community and invite customers to connect with their neighbours.\n\nMedia: iPhone photograph capturing the spirit of our previous event to inspire participation.",
        "repopostidea_32": "Title: 2 Experience a Day in Our Community-Centric Cafe\n\nIdea: A typical day at the cafe capturing the vibrant interactions with local families and community members that make us a community hub.\n\nContent Theme: Community Involvement & Support\n\nPurpose: To demonstrate our active involvement and support for the local community.\n\nMedia: TikTok style short video of a busy day at the cafe.",
        "repopostidea_33": "Title: 2 Coffee Lovers, Tell Us Your Favourites!\n\nIdea: A chance for followers to share their all-time favourite beverages from our menu and win a drink of their choice.\n\nContent Theme: Customer Experience & Satisfaction\n\nPurpose: To promote coffee menu through customer engagement and interaction.\n\nMedia: iPhone photo of the fresh coffee served at the cafe.",
        "repopostidea_34": "Title: 2 Get to Know the Cosy Corner Family\n\nIdea: A series introducing our remarkable team that makes your visit to Cosy Corner Cafe memorable.\n\nContent Theme: Employee Well-being & Inclusive Culture\n\nPurpose: To humanize our brand and let customers know the people who serve them.\n\nMedia: Short TikTok style videos introducing our team members.",
        "repopostidea_35": "Title: 2 Our People, Our Values\n\nIdea: A tribute to our staff who exemplify the values of the Cosy Corner Cafe in serving our customers.\n\nContent Theme: Employee Well-being & Inclusive Culture\n\nPurpose: To show customers our commitment towards upholding our core values in daily operations.\n\nMedia: iPhone photo of the employee who demonstrated our values.",
        "repopostidea_36": "Title: The Wonderful Journey of Our Homemade Pastries\n\nIdea: A short video showcasing our variety of fresh homemade pastries, freshly baked daily for our beloved customers.\n\nContent Theme: Quality Food & Beverages\n\nPurpose: To showcase the quality and freshness of our homemade pastries, tempting customers to come in for a treat.\n\nMedia: TikTok style short video showing the pastry-making process and the final product.",
        "repopostidea_37": "Title: Discover the Magic of Our Flavourful Organic Coffee\n\nIdea: A series of staff videos disclosing how our organic coffee beans enhance the flavour, appealing to health-conscious customers with its benefits.\n\nContent Theme: Quality Food & Beverages\n\nPurpose: To create awareness and increase interest in our unique organic coffee offerings.\n\nMedia: Short videos of staff revealing the reason why our coffee tastes so good.",
        "repopostidea_38": "Title: Embracing Our Greener Future, Together\n\nIdea: We proudly stand committed to reducing environmental impact by using sustainable packaging and rely on local farmers for fresh ingredients.\n\nContent Theme: Sustainability & Ethical Practices\n\nPurpose: To raise awareness about our sustainable practices and inspire customers to choose sustainable consumption.\n\nMedia: iPhone photos capturing our commitment towards the environment and local community.",
        "repopostidea_39": "Title: Appreciating Our Local Farming Heroes\n\nIdea: A series introducing the people behind our fresh tasty food - local farmers we source our ingredients from, emphasising our commitment to local sourcing and sustainability.\n\nContent Theme: Sustainability & Ethical Practices\n\nPurpose: To illustrate our commitment to the local economy and sustainable practices.\n\nMedia: TikTok style short video interviews with local farmers.",
        "repopostidea_40": "Title: Let's Nurture Community Ties Over a Cup of Coffee\n\nIdea: An invitation to our upcoming monthly \"Coffee and Conversations\" event focused on fostering community ties over a cup of coffee.\n\nContent Theme: Community Involvement & Support\n\nPurpose: To emphasise our involvement in the community and invite customers to connect with their neighbours.\n\nMedia: iPhone photograph capturing the spirit of our previous event to inspire participation."
    },
    "cal": {
        "calpost_1": "",
        "calpost_2": "",
        "calpost_3": "",
        "calpost_4": "",
        "calpost_5": "",
        "calpost_6": "",
        "calpost_7": "",
        "calpost_8": "",
        "calpost_9": "",
        "calpost_10": "",
        "uid_counter": 4
    }
}